// *++
//
// Copyright (c) 2004 - 2009, Intel Corporation
// All rights reserved. This program and the accompanying materials
// are licensed and made available under the terms and conditions of the BSD License
// which accompanies this distribution.  The full text of the license may be found at
// http://opensource.org/licenses/bsd-license.php
//
// THE PROGRAM IS DISTRIBUTED UNDER THE BSD LICENSE ON AN "AS IS" BASIS,
// WITHOUT WARRANTIES OR REPRESENTATIONS OF ANY KIND, EITHER EXPRESS OR IMPLIED.
//
// Module Name:
//
//   strings.uni
//
// Abstract:
//
//   String definitions for main bios screen and setup browser.
//
// --*/

// vim:fenc=ucs-2le 
/=#
#langdef en-US "English"

#string STR_FE_TITLE                           #language en-US "File explorer"

#string STR_NULL_STRING                        #language en-US ""

#string STR_MII_TITLE                          #language en-US "Initialization mode"
                                               
#string STR_MAIN_PAGE_TITLE                    #language en-US "Main menu"

#string STR_ADMIN_MAIN_PAGE_TITLE              #language en-US "Administration mode"
                                               
#string STR_USERS_TITLE                        #language en-US "Creation/removal/viewing of users"
                                               
#string STR_USERS_CREATE_TITLE                 #language en-US "Creation of users"
                                               
#string STR_USERS_DELETE_TITLE                 #language en-US "Deletion of users"
                                               
#string STR_USERS_DELETE_SURE                  #language en-US "Are you sure, you want to delete user:"
                                               
#string STR_USERS_DELETE_YES_NO                #language en-US "Press 'Y' - to delete user, 'N' - to cancel"
                                               
#string STR_USERS_VIEW_TITLE                   #language en-US "Viewing of users"
                                               
#string STR_USERS_PRESS_ENTER_TO_DELETE        #language en-US "ENTER-Delete user"
                                               
#string STR_USERS_PRESS_ENTER_TO_EDIT          #language en-US "ENTER-edit"

#string STR_USERS_TYPE_USER                    #language en-US "User"

#string STR_USERS_TYPE_ADMIN                   #language en-US "Administrator"
                                               
#string STR_USERS_CREATE                       #language en-US "Create"
                                               
#string STR_USERS_UPDATE                       #language en-US "Update"
                                               
#string STR_BLOCK_FLAG_OFF                     #language en-US "non blocked"
                                               
#string STR_BLOCK_FLAG_ON                      #language en-US "blocked"
                                               
#string STR_SUSPEND_FLAG_OFF                   #language en-US "non suspended"
                                               
#string STR_SUSPEND_FLAG_ON                    #language en-US "suspended"
                                               
#string STR_AUTH_LOGIN_PASS                    #language en-US "login password"
                                               
#string STR_AUTH_TOKEN                         #language en-US "token"
                                               
#string STR_AUTH_LDAP                          #language en-US "LDAP"

#string STR_NO_CARDS_FOR_TOKEN_USERS           #language en-US "No cards for token-users"
                                               
#string STR_TOKEN_WAS_REMOVED                  #language en-US "Token removed, rebooting now"
											   
#string STR_ERR_TOKEN_WAS_REMOVED              #language en-US "Error! Token was removed!"
                                               
#string STR_FUNCTION_DENIED_FOR_TOKEN_USR      #language en-US "Function forbidden for token-users"

#string STR_RECOVER_USERS_FROM_USB_TITLE       #language en-US "Recover users data frolem USB"

#string STR_MII_HELP                           #language en-US ""

#string STR_ERR_UNKNOWN_MODULE_FORMAT          #language en-US "Unknown module format!"
                                               
#string STR_INTEGRITY_CHECK                    #language en-US "Integrity checking ..."

#string STR_MOD_INTEGRITY_CHECK                #language en-US "Modules integrity checking ..."

#string STR_INTEGRITY_CHECK_TITLE              #language en-US "Integrity checking"
											   
#string STR_INTEGRITY_CHECK_TITLE2             #language en-US "Integrity checking:"

#string STR_CERT_INTEGRITY_CHECK               #language en-US "Integrity checking for certificates..."
                                               
#string MSG_ERR_WHILE_SAVE_CERT                #language en-US "Error while saving"
                                               
#string STR_BIOS_LOG_INTEGRITY_CHECK           #language en-US "Integrity checking for BIOS journal..."
                                               
#string STR_BIOS_USERS_INTEGRITY_CHECK         #language en-US "Integrity checking for Users storage..."

#string STR_DONE                               #language en-US "Done"

#string STR_ERR_INTEGRITY                      #language en-US "Invalid integrity data: "

#string STR_ERR_BIOS_INTEGRITY                 #language en-US "Integrity of a BIOS is broken"

#string STR_ERR_MVM_INTEGRITY                  #language en-US "Integrity of a MVM is broken"

#string STR_ERR_VMM_INTEGRITY                  #language en-US "Integrity of a VMM is broken"

#string STR_ERR_VMM_IMAGE_INTEGRITY            #language en-US "Integrity of a VMM image is broken"

#string STR_ERR_OS_KERNEL_INTEGRITY            #language en-US "Integrity of a OS kernel is broken"

#string STR_ERR_OS_IMAGE_INTEGRITY             #language en-US "Integrity of a OS image is broken"

#string STR_ERR_OS_MODULE_INTEGRITY            #language en-US "Integrity of a OS module is broken"

#string STR_SUCCESS                            #language en-US "Success"

#string STR_ERROR                              #language en-US "Error"

#string STR_ERR_INTERNAL                       #language en-US "Internal error "

#string STR_ERR_MEM_TEST                       #language en-US "Hardware testing: memory failure!"

#string STR_HASH_ERROR                         #language en-US "Wrong signature hash!"

#string STR_HASH_NOT_PRESENT                   #language en-US "Signature hash not present!"

#string STR_BIOS_HASH_CHECK                    #language en-US "BIOS signature hash check..."

#string STR_FILE_HASH_CHECK                    #language en-US "Files signatures hash check..."

#string STR_OBJECT_INFO                        #language en-US "Object"

#string STR_FAILURE_MODE                       #language en-US "Failure mode"

#string STR_FAIL_SAVE_PROMPT                   #language en-US "Fail save mode password:  "
                                               
#string STR_ENTER_PIN_PROMPT                   #language en-US "Enter PIN-code:  "

#string STR_ADM_USERNAME_PROMPT                #language en-US "Enter username:  "

#string STR_ADM_PASSWD_PROMPT                  #language en-US "Enter administrator password:  "
											   
#string STR_ADM_PASSWD_PROMPT_2                #language en-US "Retype administrator password:  "

#string STR_WRONG_PASSWD                       #language en-US "Wrong username/password!"
                                               
#string STR_WRONG_PIN                          #language en-US "Wrong PIN-code!"
                                               
#string STR_PIN_OK                             #language en-US "PIN-code accepted!"
                                               
#string STR_ERR_SELF_SIGNED                    #language en-US "Self-signed certificate can’t be accepted"
                                               
#string STR_WRONG_TOKEN_USER_DATA              #language en-US "User data allready present (not unique)!"

#string STR_PERMISSION_DENIED                  #language en-US "Error! Permission denied!"
                                               
#string STR_USERS_STORAGE_FULL                 #language en-US "No space for adding new user!"
                                               
#string STR_CURRENT_USER                       #language en-US "Current user"

#string STR_ERR_CURRENT_USER_DELETE            #language en-US "Delete operation for Current User is forbidden!"

#string STR_FW_VERSION                         #language en-US " FW version"

#string STR_FILES_ABSENT_SPEC1                 #language en-US "Files with pattern are absent:"

#string STR_CURRENTLY_NOT_SUPPORTED            #language en-US "Currently not supported"

#string STR_NOT_SET                            #language en-US "Not set"

#string STR_USER_NAME                          #language en-US "User name"

#string STR_USER_FIO                           #language en-US "User initials"

#string STR_USER_CONTACT_INFO                  #language en-US "User contact info"

#string STR_USER_PASSWORD                      #language en-US "User password"
                                               
#string STR_USER_COMPARISON                    #language en-US "Comparison data"
                                               
#string STR_USER_COMPARISON_UPDATE_PROMPT      #language en-US "For update press 'Y', cancel 'N'"
                                               
#string STR_USER_COMP_DATA_ERROR               #language en-US "Error while obtain comparison data"
                                               
#string STR_CN_NOT_SET                         #language en-US "CN: not set"
                                               
#string STR_SUBJECT_NOT_SET                    #language en-US "SUBJECT: not set"
                                               
#string STR_MAIL_NOT_SET                       #language en-US "MAIL: not set"
                                               
#string STR_DIGEST_NOT_SET                     #language en-US "DIGEST: not set"
                                               
#string STR_UID_NOT_SET                        #language en-US "UID: not set"
                                               
#string STR_USER_COMP_DATA_SUCCESS             #language en-US "Comparison data obtained successfully!"
                                               
#string STR_USER_WEAK_PASSWORD_ERR             #language en-US "Error: the password doesn't correspond to the password rules!"

#string STR_USER_PASSWORD_NOT_SET              #language en-US "<not set>"

#string STR_USER_CARD_CREATE_SUCCESS           #language en-US "User card created successfully"
                                               
#string STR_USER_CARD_UPDATE_SUCCESS           #language en-US "User card updated successfully"
                                               
#string STR_USER_CARDS_RESTORE_SUCCESS         #language en-US "User cards restored successfully"
                                               
#string STR_USER_CARDS_RESTORE_ERROR           #language en-US "Error while restoring user cards"
                                               
#string STR_ERR_USER_ALLREADY_PRESENT          #language en-US "Error! User names already exists"
                                               
#string STR_USER_LOGIN_PROMPT                  #language en-US "Login:"
                                               
#string STR_USER_AUTH_PROMPT                   #language en-US "      Authorization        "
											   
#string STR_USER_CHANGE_PASS_PROMPT            #language en-US "      Change password      "
                                               
#string STR_LOGIN_PASS_AUTH_HLP                #language en-US "For user password authorization press ENTER"
                                               
#string STR_USER_CREATE                        #language en-US "Create"
                                               
#string STR_USER_DELETE                        #language en-US "Delete"
                                               
#string STR_USER_VIEW                          #language en-US "View/Edit"
                                               
#string STR_USERS_STORE_TO_CVS_FILE            #language en-US "Store users information to USB"
											   
#string STR_USERS_PASSWORD_LEN                 #language en-US "User password length: "
                                               
#string STR_DATA_STORE_SUCCESS                 #language en-US "Data successfully saved"
                                               
#string STR_ERR_DATA_STORE                     #language en-US "Error while saving data"
                                               
#string STR_ERR_NO_ADM_USER_PRESENT            #language en-US "Error! No administrative user present!"

#string STR_DATE_TIME_SETUP                    #language en-US "Date/Time setup"

#string STR_DATE_TIME_ERROR_POPUP              #language en-US "Date/Time setup error!"
                                               
#string STR_DATE_PROMPT                        #language en-US "System date:"
                                               
#string STR_TIME_PROMPT                        #language en-US "Sytem time:"

#string STR_DATE_HELP                          #language en-US "month/day/year"
                                               
#string STR_DATE_DAY_HELP                      #language en-US "day"
                                               
#string STR_DATE_MONTH_HELP                    #language en-US "month"
                                               
#string STR_DATE_YEAR_HELP                     #language en-US "year"
                                               
#string STR_TIME_HELP                          #language en-US "hour/minute/second"

#string STR_TIME_HOUR_HELP                     #language en-US "hour"

#string STR_TIME_MINUTE_HELP                   #language en-US "minute"
                                               
#string STR_TIME_SECOND_HELP                   #language en-US "second"
                                               
#string STR_FUNCTION_NOT_AVAILABLE             #language en-US "Function not available!"
                                               
#string STR_HISTORY_TITLE                      #language en-US "BIOS log control"
                                               
#string STR_HISTORY_CLEAN_ALL                  #language en-US "Clean all unloaded"
                                               
#string STR_HISTORY_VIEW_CLEAN                 #language en-US "View/Clean"
                                               
#string STR_HISTORY_OUTSWAP_TO_USB             #language en-US "Export to USB"
                                               
#string STR_HISTORY_SEVERITY                   #language en-US "Severity"
                                               
#string STR_HISTORY_AUTO_CLEAN                 #language en-US "Auto clean"

#string STR_USER_DELETE_ERR_1                  #language en-US "Error! Can’t delete user"

#string STR_HISTORY_NEED_TO_OUTSWAP            #language en-US "Need to offload the log file"

#string STR_HISTORY_NO_REC_TO_OUTSWAP          #language en-US "No records for saving!"

#string STR_HISTORY_ERR_RECORD_DEL             #language en-US "Can't delete current record!"
                                               
#string STR_HISTORY_RECORDS_DEL_SUCCESS        #language en-US "Records deleted successfully"
                                               
#string STR_HISTORY_RECORDS_DEL_ERROR          #language en-US "Error while records delete!"
                                               
#string STR_HISTORY_PRESS_ENTER_TO_DELETE      #language en-US "ENTER-Delete record"
                                               
#string STR_EVENT                              #language en-US "Event"

#string STR_UNKNOWN_EVENT                      #language en-US "Unknown event"

#string STR_SEVERITY_EMERGENCY                 #language en-US "Emergency"
                                               
#string STR_SEVERITY_ALERT                     #language en-US "Alert"
                                               
#string STR_SEVERITY_CRITICAL                  #language en-US "Critical"

#string STR_SEVERITY_ERROR                     #language en-US "Error"
                                               
#string STR_SEVERITY_WARNING                   #language en-US "Warning"
                                               
#string STR_SEVERITY_NOTICE                    #language en-US "Notice"
    
#string STR_SEVERITY_INFO                      #language en-US "Info"

#string STR_SEVERITY_DEBUG                     #language en-US "Debug"

#string STR_EMPTY                              #language en-US "<empty>"
                                               
#string STR_BIOS_LOG_FULL                      #language en-US "BIOS log is full, need to offload"

#string STR_CERT_CTRL_TITLE                    #language en-US "Certificate control"
                                               
#string STR_CA_LOAD_UPDATE                     #language en-US "CA chain load/update"
                                               
#string STR_CA_CURRENT                         #language en-US "Current chain CA:"
                                               
#string STR_CA_DELETE                          #language en-US "CA delete"
                                               
#string STR_CRL_LOAD_UPDATE                    #language en-US "CRL load/update"
                                               
#string STR_CRL_CURRENT                        #language en-US "CRL current"
                                               
#string STR_CRL_DELETE                         #language en-US "CRL delete"
                                               
#string STR_INPUT_CERT_ID                      #language en-US "Input certificate ID"
                                               
#string STR_ERR_CA_NOT_LOADED                  #language en-US "CA not loaded!"
                                               
#string STR_ERR_CA_EXPIRE_VALIDATY             #language en-US "CA validity date expired"
                                               
#string STR_ERR_CA_NOT_VALIDATY                #language en-US "CA not valid date!"
                                               
#string STR_ERR_USER_PASS_EXPIRE               #language en-US "User password validity date expired! Change the password!"
                                               
#string STR_ERR_CA_SIGN                        #language en-US "CA sign error!"

#string STR_BIOS_LOCK1                         #language en-US "       BIOS locked       "
                                               
#string STR_TOKEN_LOGIN_NEED_RESTART           #language en-US "For token login need to restart system!"
                                               
#string STR_TOKEN_DOUBLE_WARN                  #language en-US "2 or more tokens are forbidden!"
                                               
#string STR_WRONG_USER_FOR_THIS_MODE           #language en-US "This mode is allowed only for token users"

#string STR_INFO_READ_DATA                     #language en-US "Reading data"
                                               
#string STR_INFO_READED                        #language en-US "read"
                                               
#string STR_INFO_FROM                          #language en-US "from"
                                               
#string STR_WRONG_BIOS_FILE                    #language en-US "Wrong BIOS-file!"
                                               
#string STR_WRONG_UPDATE_FILE                  #language en-US "Wrong BIOS-file for update!"
                                               
#string STR_BIOS_UPDATE_SURE                   #language en-US "Proceed with update? ('Y'=Yes 'N'=No)"
                                               
#string STR_ERR_ENGENEER_PASS                  #language en-US "Engineering password not found"
                                               
#string STR_ERR_BIOS_SIGNATURE                 #language en-US "Wrong BIOS signature!"
                                               
#string STR_ERR_BIOS_UPDATE                    #language en-US "BIOS update error!"
                                               
#string STR_BIOS_UPDATE_OK                     #language en-US "BIOS update success!"
                                               
#string STR_BIOS_WRITTING                      #language en-US "Writing BIOS: "
                                               
#string STR_BIOS_ERASING                       #language en-US "Erasing BIOS: "
                                               
#string STR_BIOS_REST                          #language en-US "Remaining: "
                                               
#string STR_BIOS_BUILD                         #language en-US "BIOS build: "
                                               
#string STR_PLATFORM_GUID                      #language en-US "Platform: "

#string STR_ERR_BIOS_INFO_NOT_FOUND            #language en-US "BIOS build info not found!"
                                               
#string STR_ERR_BIOS_WRONG_HW_GUID             #language en-US "BIOS wrong hw-guid!"

#string STR_RECOVER_MODE_PAGE_TITLE            #language en-US "Recovery mode"
                                               
#string STR_CHOOSE_RECOVER_PARAMS              #language en-US "Choose recovery params"

#string STR_YOUR_CHOISE                        #language en-US "Your choice: ('Y'=Yes 'N'=No)"
                                              
#string STR_END_OF_ADMIN_MODE                  #language en-US "Exit admin mode?"
                                               
#string STR_PCI_DEV_LIST_MODE_PAGE_TITLE       #language en-US "PCI devices list"
                                               
#string STR_SAVE_AND_REBOOT                    #language en-US "Save changes and reboot?"
                                               
#string STR_LOAD_DEFAULTS                      #language en-US "Load defaults"
                                               
#string STR_LOAD_DEFAULTS_ERROR                #language en-US "Error while loading defaults"
                                               
#string STR_ADVANCED_MODE_PAGE_TITLE           #language en-US "Advanced mode"
                                               
#string STR_CHECKING_FOR_PIN                   #language en-US "                     Checking for PIN-code                         "
                                               
#string STR_LOADING_MODULES_PARAMS_TITLE       #language en-US "Loading modules params"

#string STR_CHECK_SYS_TIME_DATE                #language en-US "Error! Please check system date/time!"
											   
#string STR_PASS_TOO_SHORT                     #language en-US "Error! Password too short (less than 6 symbols)!"
											   
#string STR_PASS_TOO_LONG                      #language en-US "Error! Password too long (more than 20 symbols)!"
											   
#string STR_PASS_NOT_SAME                      #language en-US "Error! Passwords do not match"
											   
#string STR_PASS_SAME_AS_OLD                   #language en-US "Error! Entered password the same as previous password!"
											   
#string STR_PASS_UPDATE_SUCCESS                #language en-US "Password updated successfully"
											   
#string STR_PASS_UPDATE_FAIL                   #language en-US "Password update failure"
											   
#string STR_USR_NAME_UNKNOWN                   #language en-US "Unknown"
											   
#string STR_WRONG_DATE_TIME_CHANGE_PASS        #language en-US "Wrong data/time! Please change password!"
											   
#string STR_REBOOT_WHILE_CUR_USR_UPDATE        #language en-US "Current user credential data was changed! Rebooting now!"
											   
#string STR_CHANGE_FOR_USR_NAME_DISABLED       #language en-US "User name changing disabled"

#string STR_USR_NAME_LDAP_LOG                  #language en-US "LDAP log"
											   
#string STR_USER_DELETE_ERR_2_1                #language en-US "It is necessary to delete log records of the user"
											   
#string STR_USER_DELETE_ERR_2_2                #language en-US "or to enable automatic cleaning"

#string STR_HISTORY_LOG_EMPTY                  #language en-US "History log is empty!"

#string STR_NETWORK_SETTINGS_TITLE             #language en-US "Network configurations"

#string STR_AUTH_LDAP                          #language en-US "LDAP"

#string STR_LDAP_CONFIG_ERROR                  #language en-US "Error! Can't read ldap config!"

#string STR_LDAP_CONNECT_ERROR                 #language en-US "Error! Can't connect to ldap server!"

#string STR_LDAP_UNKNOWN_ERROR                 #language en-US "Error! LDAP: Unknown error!"

#string STR_INCORRECT_IP_ADDRESS               #language en-US "Error! Incorrect IP address!"

#string STR_BAD_LDAP_CONF_SETTINGS             #language en-US "Error! Bad ldap config options!"

#string STR_LDAP_SESSION_ERROR                 #language en-US "Error! Ldap session error!"

#string STR_LOAD_LDAP_AUTH_ERROR               #language en-US "Error! Load ldap auth module error!"
                                               
#string STR_MAKE_LDAP_REQUEST_ERROR            #language en-US "Error! Can't make request to ldap server!"
                                               
#string STR_CANT_FIND_LDAP_USER                #language en-US "Error! Can't find user on ldap server!"
                                               
#string STR_CHECK_LDAP_USER                    #language en-US "Checking user, please wait..."
                                               
#string STR_CONFIG_SAVES_SUCCESS               #language en-US "Config successfully saved"
                                               
#string STR_CONFIG_SAVES_ERROR                 #language en-US "Error! Config save failed"
                                               
#string STR_CHECK_LDAP_PWD                     #language en-US "Checking password, please wait..."
                                               
#string STR_LDAP_DENY_ERROR                    #language en-US "Server rejected to perform requested action"
                                               
#string STR_LDAP_TOO_MANY_ENTRIES              #language en-US "Several users with identical data have been found on LDAP server"
                                               
#string STR_CORRRESPONDENCE_DATA_TYPE_ERROR    #language en-US "Please, enter at least one type of a comparison!"
                                               
#string STR_GUEST_LOGIN_FAIL                   #language en-US "Error! Can't authenticate a guest user"
                                               
#string STR_GUEST_UNSUPPORTED_SETTING          #language en-US "Error! Select ldap or local setting!"
                                               
#string STR_LDAP_TLS_CACERTFILE_EMPTY          #language en-US "Error! CA not loaded!"
                                               
#string STR_LDAP_TLS_CACERTFILE_FAIL           #language en-US "Error! Can't pass CA to the ldap internal storage!"

#string STR_LOADING_MODULES_CHECKING_DONE      #language en-US "Loading modules checking done!"

#string STR_LOADING_OS_MODULE_ERR              #language en-US "Error while loading os module!"

#string STR_WAIT_FOR_LOADING_OS                #language en-US "Loading OS please wait..."

#string STR_WAIT_FOR_CHECKING_MODULES          #language en-US "Checking for modules, please wait..."
                                               
#string STR_ASK_FOR_UPDATE_EFI_VARS            #language en-US "Update EFI-variables (Y/N) (Y/N)?"

#string STR_LDAP_AUTH_SUCCESS                  #language en-US "Ldap login success"

#string STR_VIDEO_IGD                          #language en-US "IGD"
											   
#string STR_VIDEO_IGD_HELP                     #language en-US "Integrated graphics drivers"
											   
#string STR_VIDEO_PEC                          #language en-US "PEG"
											   
#string STR_VIDEO_PEC_HELP                     #language en-US "PCI-E videocard"
											   
#string STR_VIDEO_HELP                         #language en-US "IGD=Integrated graphics drivers, PEG=PCI-E video card"
											   
#string STR_BIOS_DATA_CORRUPT                  #language en-US "Internal BIOS data corrupt!"
											   
#string STR_CERT_LOAD_UPDATE                   #language en-US "TLS client certificate load/update"
                                               
#string STR_CERT_CURRENT                       #language en-US "Current certificate:"
                                               
#string STR_CERT_DELETE                        #language en-US "TLS client certificate delete"
                                               
#string STR_PKEY_LOAD_UPDATE                   #language en-US "TLS client pkey load/update"
                                               
#string STR_PKEY_CURRENT                       #language en-US "Current pkey:"
                                               
#string STR_PKEY_DELETE                        #language en-US "TLS client pkey delete"
                                               
#string STR_ERR_WHILE_SAVE_DATA                #language en-US "Error while save data!"

#string STR_EXIT_AND_REBOOT                    #language en-US "Exit and reboot?"
											   
#string STR_WAIT_FOR_SAVING_HISTORY            #language en-US "Saving history. Please wait..."
											   
#string STR_WAIT_FOR_CLEANING_HISTORY          #language en-US "Cleaning history. Please wait..."
											   
#string STR_PLEASE_INSERT_FLASH_IN_PROPER_PORT #language en-US "Please, insert flash into proper USB-port"

#string STR_UNKNOWN_FORMAT_OF_CERTIFICATE      #language en-US "Error! Format of the certificate is unknown"

#string MSG_CERT_STORAGE_NOT_EMPTY             #language en-US "Please, delete CRL/TLS cert first"

#string MSG_ERR_CERT_REVOKED                   #language en-US "Certificate is revoked"

#string MSG_ERR_GET_CA_PUBKEY                  #language en-US "Can't get public key from CA"

#string MSG_UNKNOWN_FORMAT_OF_CRL              #language en-US "Error! Format of the CRL is unknown"

#string MSG_ERR_WHILE_SAVE_KEY                 #language en-US "Error while save key"

#string MSG_ERR_CRL_VERIFY                     #language en-US "Error CRL sign"

#string MSG_UNKNOWN_FORMAT_OF_KEY              #language en-US "Error! Format of the key is unknown!"

#string MSG_CRL_STORAGE_NOT_EMPTY              #language en-US "Delete CRL first"

#string MSG_ERR_CA_REVOKED                     #language en-US "CA is revoked!"
											   
#string MSG_LOG_READING_ERROR                  #language en-US "Error while reading log!"

#string MSG_ERR_CLIENT_CERT_SIGN               #language en-US "Client certificate sign error!"

#string STR_USB_LEGACY_SUPPORT_ENABLE          #language en-US "Enable"

#string STR_USB_LEGACY_SUPPORT_DISABLE         #language en-US "Disable"

#string STR_USB_LEGACY_SUPPORT_HELP            #language en-US "Enable/Disable"
                                               
#string MSG_URL_EMPTY                          #language en-US "Please, input URL"

#string MSG_PKCS7_NOT_SIGNED                   #language en-US "PKCS7 certificate chain is not signed"

#string MSG_VERIFY_ERROR                       #language en-US "Structure verify error"

#string MSG_ERROR_TO_LOAD_CRL                  #language en-US "CRL not loaded"

#string MSG_ERROR_TO_LOAD_ISSUER_CERT          #language en-US "Issuer certificate not loaded! The list of trusted certificates is not complete"

#string MSG_ERROR_TO_LOAD_ISSUER_CERT_LOCALLY  #language en-US "The issuer certificate of an user certificate cannot be found"

#string MSG_CANT_GET_TRUSTED_CERTS             #language en-US "Cant find trusted chain in the PKCS7 structure"

#string MSG_CERT_NOT_YET_VALID                 #language en-US "The certificate is not yet valid"

#string MSG_CERT_HAS_EXPIRED                   #language en-US "Certificate is expired"

#string MSG_CRL_NOT_YET_VALID                  #language en-US "CRL not yet valid"

#string MSG_CRL_HAS_EXPIRED                    #language en-US "CRL is expired"

#string MSG_UNKNOWN_FORMAT_OF_CHAIN            #language en-US "Error! Format of the trusted chain is unknown"

#string STR_TLS_CA_LOAD_UPDATE                 #language en-US "TLS CA load/update"
                                               
#string STR_TLS_CA_CURRENT                     #language en-US "Current TLS CA:"
                                               
#string STR_TLS_CA_DELETE                      #language en-US "TLS CA delete"

#string MSG_TLS_STORAGE_NOT_EMPTY             #language en-US "Please, delete TLS certificate and key first"

#string MSG_OCPS_URL_ERROR                    #language en-US "Error! Please, check OCSP URL"

#string MSG_OCSP_RESPONSE_VERIFICATION        #language en-US "Error to verify OCSP responce"

#string MSG_OCSP_RESPONDER_QUERY_FAILED       #language en-US "Error while send OCSP request"

#string MSG_OCSP_CERT_UNKNOWN                 #language en-US "OCSP Error! Certificate is unknown!"

#string MSG_CDP_ERROR                         #language en-US "CDP Error"

#string MSG_UNABLE_TO_GET_CRL                 #language en-US "Can't find CRL to verify certificate/CA chain"

#string MSG_CDP_URL_IS_EMPTY                  #language en-US "CDP URL is empty"

#string MSG_CDP_CANT_PARSE_URL                #language en-US "Cant parse CDP URL"

#string MSG_CDP_UNSUPPORTED_PROTOCOL          #language en-US "Unsupported protocol in CDP URL"

#string STR_CDP_LDAP_TOO_MANY_ENTRIES          #language en-US "Several CDP records with equal parameneters have found"

#string STR_LDAP_SEARCH_ERROR                  #language en-US "No CRLs on the LDAP server"

#string STR_SATA_MODE_IDE                      #language en-US "IDE"

#string STR_SATA_MODE_AHCI                     #language en-US "AHCI"

#string STR_SATA_MODE_HELP                     #language en-US "AHCI=Advanced Host Controller Interface, IDE=Legacy mode"

#string STR_TLS_START_ERROR                    #language en-US "Error to start TLS"

#string STR_UNABLE_TO_GET_CRL_ERROR            #language en-US "Unable to get certificate CRL"

#string MSG_ERROR_TO_GET_PERMIT                #language en-US "Error to get user permissions for this workstation"

#string STR_PASSWORD_SET                       #language en-US " set"

#string STR_PASSWORD_NOT_SET                   #language en-US " not set"

#string STR_USERS_REMOTE_CTRL                  #language en-US "Remote managment"
											   
#string STR_USERS_ADMIN_ROLE                   #language en-US "Administrator role"
											   
#string STR_ADMIN_ROLE_AUDIT                   #language en-US "Audit"
											   
#string STR_ADMIN_ROLE_FULL_ACCESS             #language en-US "Full access"
											   
#string STR_COMP_UNBLOCK_SUCCESS               #language en-US "Complex unblocked successfully!"
											   
#string STR_COMP_UNBLOCK_ERROR                 #language en-US "Error while complex unblocking!"
											   
#string STR_REMOTE_PROTOCOL_ACCESS_INFO        #language en-US "BIOS in the remote accessing mode"
											   
#string STR_MSG_RTC_RST                        #language en-US "RTC_RST is detected! Goto initial initialization mode? (Y/N)"

#string STR_USER_LIST_FROM_LDAP                #language en-US "Load users from LDAP"
											   
#string STR_MSG_WAIT_FOR_USERS_FROM_LDAP       #language en-US "Synchronizing user base. Please wait."

#string MSG_WAIT_FOR_CRL_DOWNLOAD              #language en-US "Refreshing CRLs. Please wait."

#string STR_CONFIG_APPLY_SUCCESS               #language en-US "Config successfully applied"

#string STR_CONFIG_SETTINGS_UNSUPPORTED        #language en-US "Settings combination is upsupported"

#string STR_CONFIG_INCORRECT_VALUE             #language en-US "Parameter value is incorrect"

#string STR_REMOTE_CFG_TLS_CONFIG_ERROR        #language en-US "Error! Can't read Remote Config TLS settings!"

#string STR_MSG_WARN_TLS_AND_CRL               #language en-US "After updating the CA check the TLS certificates and CRL"
